src/cf/InformationRegisters/GDS_НастройкиВнешнихСоединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_НастройкиВнешнихСоединений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаСоединенияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнтеграции</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ВидыНастроекВнешнихСоединений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_ОбменДаннымиНастройки/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Прочитать(ВидНастройки, УзелИнтеграции = Неопределено) Экспорт
	
	ИдентификаторБазы = ИдентификаторТекущейБазы();
	Настройки = РегистрыСведений.GDS_НастройкиВнешнихСоединений.Прочитать(ИдентификаторБазы, ВидНастройки, УзелИнтеграции);
	
	Возврат Настройки;
	
КонецФункции

Функция СтрокаСоединенияТекущейБазы() Экспорт
	
	Возврат СтрокаСоединенияИнформационнойБазы();
	
КонецФункции

Функция ИдентификаторТекущейБазы() Экспорт
	
	Возврат ХэшСтроки(СтрокаСоединенияИнформационнойБазы());
	
КонецФункции

Функция ХэшСтроки(ИсходнаяСтрока) Экспорт
	
	НормализованнаяСтрока = НормализоватьСтроку(ИсходнаяСтрока);
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(ПолучитьДвоичныеДанныеИзСтроки(НормализованнаяСтрока));
	
	Возврат СтрЗаменить(Хеширование.ХешСумма, " ", "");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализоватьСтроку(ИсходнаяСтрока)
	
	Если ИсходнаяСтрока = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	НормализованнаяСтрока = НРег(СокрЛП(Строка(ИсходнаяСтрока)));
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.Таб, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.ПС, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, Символы.ВК, "");
	НормализованнаяСтрока = СтрЗаменить(НормализованнаяСтрока, " ", "");
	
	Возврат НормализованнаяСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли
